<script setup>
import MakeComment from '@/components/layouts/MakeComment.vue';
import TheButton from '../layouts/TheButton.vue';
import { ref } from 'vue';

let commentInput = ref('')
// let input = ref(null)
let fileInput = ref(null)
let fileName = ref('')

const changeFile = (event) => {
    try {
        const selectedFile = event.target.files[0];
        fileInput.value = selectedFile
        fileName.value = selectedFile.name;
        console.log("Selected file name: " + fileName.value);
    } catch (err) {
        console.log(err);
    }
};



const deleteFile = () => {
    // input.value = null
    fileInput.value = null
    fileName.value = ''
}
</script>

<template>
    <div class="lesson__task">
        <div class="lesson__task-title">
            Задание к уроку 1. Введение в финансовую грамотность. 
        </div>
        <div class="lesson__task-text">
            <ul class="numbers">
                <li>
                    Создайте проект в Excel и назовите его “ ДЗ 1. Создание личного бюджета.”
                </li>
                <li>
                    Начните с создания двух колонок: "Доходы" и "Расходы".
                </li>
                <li>
                    В столбце "Доходы" укажите все источники дохода, которые у вас есть на месяц. Это могут быть заработная плата, стипендия, дополнительный доход и другие источники.
                </li>
                <li>
                    В столбце "Расходы" перечислите все обязательные расходы, такие как аренда жилья, коммунальные платежи, продукты питания, транспорт, страховки, кредиты и другие. Важно включить все расходы, даже небольшие.
                </li>
                <li>
                    Разделите расходы на две категории: фиксированные (неизменные) и переменные (которые могут меняться).
                </li>
                <li>
                    После того как вы заполнили обе колонки, вычислите сумму доходов и сумму расходов на месяц.
                </li>
                <li>
                    Сделайте скриншот и вставьте его в созданный файл в Word.
                </li>
                <li>
                    Попробуйте ответить на следующие вопросы:
                </li>
                <li>
                    Сколько денег у вас остается после покрытия всех обязательных расходов?
                </li>
                <li>
                    Как можно сэкономить или оптимизировать расходы?
                </li>
                <li>
                    Есть ли возможность увеличить доходы?
                </li>
                <li>
                    Запишите свои ответы на вопросы в Word и прикрепите файл на данную страницу.
                </li>
            </ul>
        </div>
        <div class="add-file-w">
            <label class="add-file">
                <input
                    type="file"
                    @change="((event) => changeFile(event))"
                />
                <svg class="add-file-icon" xmlns="http://www.w3.org/2000/svg" width="40" height="41" viewBox="0 0 40 41" fill="none">
                    <path d="M27.8457 11.1729L21.179 4.33552C21.0242 4.17634 20.8402 4.05004 20.6378 3.96387C20.4353 3.8777 20.2182 3.83334 19.999 3.83334C19.7798 3.83334 19.5627 3.8777 19.3602 3.96387C19.1577 4.05004 18.9738 4.17634 18.819 4.33552L12.1523 11.1729C11.8398 11.4938 11.6644 11.929 11.6647 12.3826C11.665 12.8362 11.841 13.271 12.154 13.5916C12.4669 13.9121 12.8912 14.092 13.3335 14.0916C13.7758 14.0913 14.1998 13.9108 14.5123 13.5899L18.334 9.67035V24.3467C18.334 24.8 18.5096 25.2348 18.8221 25.5554C19.1347 25.8759 19.5586 26.056 20.0007 26.056C20.4427 26.056 20.8666 25.8759 21.1792 25.5554C21.4917 25.2348 21.6673 24.8 21.6673 24.3467V9.67035L25.489 13.5899C25.8033 13.9012 26.2243 14.0735 26.6613 14.0696C27.0983 14.0657 27.5163 13.886 27.8253 13.569C28.1344 13.2521 28.3096 12.8234 28.3134 12.3752C28.3172 11.927 28.1493 11.4952 27.8457 11.1729Z" fill="#D1D5DB"/>
                    <path d="M33.334 23.492H25.0007V24.3467C25.0007 25.7067 24.4739 27.011 23.5362 27.9727C22.5985 28.9344 21.3267 29.4747 20.0007 29.4747C18.6746 29.4747 17.4028 28.9344 16.4651 27.9727C15.5274 27.011 15.0007 25.7067 15.0007 24.3467V23.492H6.66732C5.78326 23.492 4.93542 23.8522 4.31029 24.4933C3.68517 25.1344 3.33398 26.004 3.33398 26.9107V33.748C3.33398 34.6547 3.68517 35.5243 4.31029 36.1654C4.93542 36.8065 5.78326 37.1667 6.66732 37.1667H33.334C34.218 37.1667 35.0659 36.8065 35.691 36.1654C36.3161 35.5243 36.6673 34.6547 36.6673 33.748V26.9107C36.6673 26.004 36.3161 25.1344 35.691 24.4933C35.0659 23.8522 34.218 23.492 33.334 23.492ZM29.1673 33.748C28.6729 33.748 28.1895 33.5976 27.7784 33.3159C27.3673 33.0342 27.0468 32.6337 26.8576 32.1652C26.6684 31.6967 26.6189 31.1812 26.7154 30.6838C26.8118 30.1864 27.0499 29.7296 27.3996 29.371C27.7492 29.0124 28.1946 28.7682 28.6796 28.6693C29.1645 28.5704 29.6672 28.6211 30.124 28.8152C30.5808 29.0093 30.9713 29.3379 31.246 29.7595C31.5207 30.1812 31.6673 30.6769 31.6673 31.184C31.6673 31.864 31.4039 32.5162 30.9351 32.997C30.4662 33.4779 29.8304 33.748 29.1673 33.748Z" fill="#D1D5DB"/>
                </svg>
                <p>
                    Кликните для загрузки или перетащите и отпустите
                </p>
                <span>
                    DOCX, PDF, PNG, JPG or PPTX (до 2 МБ)
                </span>
            </label>
            <the-button
                :styles="['btn_red']"
                :type="'button'"
                class="add-file-btn"
            >
                Отправить
            </the-button>
        </div>
        <div class="file-info"
            v-if="fileName"
        >
            <div class="file-info__header">
                <p>
                    Выгруженные файлы :
                </p>
                <span>
                    25 августа 2023 в 21:35
                </span>
            </div>
            <div class="file-info__item">
                <span>
                    <!-- Дз 1. Введение в финансовую грамотность.docx -->
                    {{ fileName }}
                </span>
                <svg xmlns="http://www.w3.org/2000/svg" width="20" height="21" viewBox="0 0 20 21" fill="none"
                    @click="deleteFile()"
                >
                    <path d="M16.6667 5.67546H13.3333V3.92107C13.3333 3.45578 13.1577 3.00955 12.8452 2.68053C12.5326 2.35152 12.1087 2.16669 11.6667 2.16669H8.33333C7.89131 2.16669 7.46738 2.35152 7.15482 2.68053C6.84226 3.00955 6.66667 3.45578 6.66667 3.92107V5.67546H3.33333C3.11232 5.67546 2.90036 5.76788 2.74408 5.93238C2.5878 6.09689 2.5 6.32001 2.5 6.55265C2.5 6.7853 2.5878 7.00842 2.74408 7.17292C2.90036 7.33743 3.11232 7.42985 3.33333 7.42985H4.16667V17.079C4.16667 17.5443 4.34226 17.9905 4.65482 18.3195C4.96738 18.6485 5.39131 18.8334 5.83333 18.8334H14.1667C14.6087 18.8334 15.0326 18.6485 15.3452 18.3195C15.6577 17.9905 15.8333 17.5443 15.8333 17.079V7.42985H16.6667C16.8877 7.42985 17.0996 7.33743 17.2559 7.17292C17.4122 7.00842 17.5 6.7853 17.5 6.55265C17.5 6.32001 17.4122 6.09689 17.2559 5.93238C17.0996 5.76788 16.8877 5.67546 16.6667 5.67546ZM8.33333 3.92107H11.6667V5.67546H8.33333V3.92107ZM14.1667 17.079H5.83333V7.42985H14.1667V17.079Z" fill="#9CA3AF"/>
                    <path d="M8.33333 8.30704C8.11232 8.30704 7.90036 8.39946 7.74408 8.56396C7.5878 8.72847 7.5 8.95159 7.5 9.18423V15.3246C7.5 15.5572 7.5878 15.7803 7.74408 15.9449C7.90036 16.1094 8.11232 16.2018 8.33333 16.2018C8.55435 16.2018 8.76631 16.1094 8.92259 15.9449C9.07887 15.7803 9.16667 15.5572 9.16667 15.3246V9.18423C9.16667 8.95159 9.07887 8.72847 8.92259 8.56396C8.76631 8.39946 8.55435 8.30704 8.33333 8.30704Z" fill="#9CA3AF"/>
                    <path d="M11.6667 8.30704C11.4457 8.30704 11.2337 8.39946 11.0774 8.56396C10.9211 8.72847 10.8333 8.95159 10.8333 9.18423V15.3246C10.8333 15.5572 10.9211 15.7803 11.0774 15.9449C11.2337 16.1094 11.4457 16.2018 11.6667 16.2018C11.8877 16.2018 12.0996 16.1094 12.2559 15.9449C12.4122 15.7803 12.5 15.5572 12.5 15.3246V9.18423C12.5 8.95159 12.4122 8.72847 12.2559 8.56396C12.0996 8.39946 11.8877 8.30704 11.6667 8.30704Z" fill="#9CA3AF"/>
                </svg>
            </div>
        </div>
        <make-comment
            v-model="commentInput"
            @update:modelValue="(modelValue) => commentInput=modelValue"
        />
    </div>
</template>

<style lang="scss" scoped>
ul.numbers {
    padding-left: 15px;
    & li {
        list-style-type: auto;
    }
}
.lesson {

    &__task {
    }

    &__task-title {
        color: var(--gray-900, #111928);
        font-family: Roboto;
        font-size: 20px;
        font-style: normal;
        font-weight: 500;
        line-height: 150%; /* 30px */
        margin-bottom: 40px;
        @media (max-width: 1023px) {
            margin-bottom: 10px;
        }
    }

    &__task-text {
        color: var(--gray-900, #111928);
        font-family: Roboto;
        font-size: 16px;
        font-style: normal;
        font-weight: 400;
        line-height: 167%; /* 26.72px */
        margin-bottom: 60px;
        @media (max-width: 1023px) {
            margin-bottom: 20px;
        }
    }
}

.add-file-icon {
}

.file-info {
    margin-bottom: 40px;
    &__header {
        display: flex;
        justify-content: space-between;
        gap: 20px;
        margin-bottom: 20px;
        & p {
            color: var(--gray-900, #111928);
            font-family: Roboto;
            font-size: 16px;
            font-style: normal;
            font-weight: 400;
            line-height: 167%; /* 26.72px */
        }
        & span {
            color: var(--gray-400, #9CA3AF);
            font-family: Roboto;
            font-size: 14px;
            font-style: normal;
            font-weight: 400;
            line-height: 150%; /* 21px */
        }
    }

    &__item {
        border-radius: var(--rounded-xl, 12px);
        background: var(--gray-100, #F3F4F6);
        padding: 12px 20px;
        display: flex;
        justify-content: space-between;
        gap: 20px;
        color: var(--gray-600, #4B5563);
        font-family: Roboto;
        font-size: 16px;
        font-style: normal;
        font-weight: 400;
        line-height: 167%; /* 26.72px */
        & svg {
            cursor: pointer;
        }
    }
}

[dark=true] {
    & .lesson__task-title {
        color: var(--gray-50, #F9FAFB);
    }

    & .lesson__task-text {
        color: var(--gray-50, #F9FAFB);
    }


}

</style>