backend/course-service/app/controllers/courses_controller.rb

  def show
    @course = Course.find(params['id'])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    period = Period.create(
      starts_at: params['period']['starts_at'],
      ends_at: params['period']['ends_at']
    )

    # course_type = CourseType.where(name: params['course_type']).first
    course_type = CourseType.find_or_create_by!(name: params['course_type'])
    # render json: {message: "wrong course_type"}, status: 400 unless course_type

    price = params['price'].to_f if params.include? 'price'

    education_form = EducationForm.find_by(name: params['education_form'])
    return render json: {message: "wrong course_type"}, status: 400 unless course_type

    if @course = Course.create(
        name: params['name'],
        description: params['description'],
        price: price,
        course_type_id: course_type.id,
        period_id: period.id,
        education_form_id: education_form.id
      )
---
INSERT INTO "periods" ("starts_at", "ends_at") VALUES ($1, $2) RETURNING "id"  [["starts_at", "2023-05-10"], ["ends_at", "2023-05-15"]]
INSERT INTO "courses" ("name", "description", "advantages", "price", "course_type_id", "period_id", "education_form_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "course_types" ("name") VALUES ($1) RETURNING "id"  [["name", "Базовый"]]
SELECT "course_types".* FROM "course_types" WHERE "course_types"."name" = $1 LIMIT $2  [["name", "Базовый"], ["LIMIT", 1]]
SELECT "education_forms".* FROM "education_forms" WHERE "education_forms"."name" = $1 LIMIT $2  [["name", "Очная"], ["LIMIT", 1]]