backend/course-service/app/controllers/education_forms_controller.rb

SELECT "education_forms".* FROM "education_forms"
---
  def index
    @forms = EducationForm.all