backend/course-service/app/controllers/lectures_controller.rb

  def create
    course = Course.find_by(id: params['course_id'])
    return render json: {message: 'course not found'}, status: 404 if course.nil?

    if @lecture = Lecture.create(
        name: params['name'],
        description: params['description'],
        starts_at: params['starts_at'],
        course_id: course.id
      )

      params['contents']&.each do |content|
        type = ContentType.find_or_create_by!(name: content['type'])
        Content.create(
          lecture_id: @lecture.id,
          url: content['url'],
          content_type_id: type.id
        )
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", "96cabdf5-b922-4210-8746-743e6e816936"], ["LIMIT", 1]]
INSERT INTO "lectures" ("name", "description", "starts_at", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "contents" ("url", "content_type_id", "lecture_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "content_types".* FROM "content_types" WHERE "content_types"."name" = $1 LIMIT $2  [["name", "video"], ["LIMIT", 1]]